app/Models/Dinner_table.php

SELECT *
FROM `ospos_dinner_tables`
WHERE `dinner_table_id` = 1
---
    public function exists(int $dinner_table_id): bool
    {
        $builder = $this->db->table('dinner_tables');
        $builder->where('dinner_table_id', $dinner_table_id);

        return ($builder->get()->getNumRows() >= 1);

UPDATE `ospos_dinner_tables` SET `name` = 'Kasir  01', `deleted` = 0
WHERE `dinner_table_id` = 1
---
    public function save_value(array $table_data, int $dinner_table_id): bool
    {
        $table_data_to_save = ['name' => $table_data['name'], 'deleted' => 0];

        $builder = $this->db->table('dinner_tables');
        if (!$this->exists($dinner_table_id)) {
            return $builder->insert($table_data_to_save);
        }

        $builder->where('dinner_table_id', $dinner_table_id);

        return $builder->update($table_data_to_save);

SELECT *
FROM `ospos_dinner_tables`
WHERE `status` = 0
OR `dinner_table_id` IS NULL
AND `deleted` = 0
---
    public function get_empty_tables(?int $current_dinner_table_id): array
    {
        $builder = $this->db->table('dinner_tables');
        $builder->where('status', 0);
        $builder->orWhere('dinner_table_id', $current_dinner_table_id);
        $builder->where('deleted', 0);

        $empty_tables = $builder->get()->getResultArray();

SELECT *
FROM `ospos_dinner_tables`
WHERE `deleted` = 0
---
    public function get_all(): ResultInterface
    {
        $builder = $this->db->table('dinner_tables');
        $builder->where('deleted', 0);

        return $builder->get();